{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[STOP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SPACE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[STOP]": 0,
      "[UNK]": 1,
      "[SPACE]": 2,
      "!": 3,
      "\"": 4,
      "'": 5,
      "(": 6,
      ")": 7,
      ",": 8,
      "-": 9,
      ".": 10,
      "/": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      ":": 22,
      "?": 23,
      "a": 24,
      "b": 25,
      "c": 26,
      "d": 27,
      "e": 28,
      "f": 29,
      "g": 30,
      "h": 31,
      "i": 32,
      "j": 33,
      "k": 34,
      "l": 35,
      "m": 36,
      "n": 37,
      "o": 38,
      "p": 39,
      "q": 40,
      "r": 41,
      "s": 42,
      "t": 43,
      "u": 44,
      "v": 45,
      "w": 46,
      "x": 47,
      "y": 48,
      "z": 49,
      "~": 50,
      "hi": 51,
      "ka": 52,
      "ta": 53,
      "na": 54,
      "no": 55,
      "ou": 56,
      "shi": 57,
      "te": 58,
      "wa": 59,
      "su": 60,
      "to": 61,
      "..": 62,
      "ni": 63,
      "ku": 64,
      "da": 65,
      "ko": 66,
      "ru": 67,
      "mo": 68,
      "ga": 69,
      "ma": 70,
      "ra": 71,
      "ki": 72,
      "re": 73,
      "de": 74,
      "wo": 75,
      "tsu": 76,
      "sa": 77,
      "...": 78,
      "ri": 79,
      "ha": 80,
      "ke": 81,
      "mi": 82,
      "chi": 83,
      "tte": 84,
      "so": 85,
      "se": 86,
      "yo": 87,
      "nai": 88,
      "you": 89,
      "ya": 90,
      "tta": 91,
      "sh": 92,
      "ji": 93,
      "me": 94,
      "do": 95,
      "kara": 96,
      "shite": 97,
      "koto": 98,
      "ne": 99,
      "ba": 100,
      "uu": 101,
      "ro": 102,
      "shita": 103,
      "zu": 104,
      "ho": 105,
      "en": 106,
      "fu": 107,
      "kan": 108,
      "sou": 109,
      "nan": 110,
      "kai": 111,
      "bu": 112,
      "tai": 113,
      "go": 114,
      "hou": 115,
      "shou": 116,
      "taku": 117,
      "kou": 118,
      "aru": 119,
      "ja": 120,
      "ai": 121,
      "sore": 122,
      "dou": 123,
      "suru": 124,
      "mu": 125,
      "iru": 126,
      "bi": 127,
      "oku": 128,
      "sen": 129,
      "wataku": 130,
      "shin": 131,
      "mono": 132,
      "tachi": 133,
      "desu": 134,
      "nna": 135,
      "jou": 136,
      "sei": 137,
      "kono": 138,
      "ii": 139,
      "watakushi": 140,
      "san": 141,
      "yuu": 142,
      "hito": 143,
      "tou": 144,
      "mae": 145,
      "sai": 146,
      "tto": 147,
      "ita": 148,
      "mou": 149,
      "katta": 150,
      "oi": 151,
      "kure": 152,
      "be": 153,
      "zo": 154,
      "ima": 155,
      "ge": 156,
      "ken": 157,
      "sono": 158,
      "kyou": 159,
      "dai": 160,
      "rou": 161,
      "gi": 162,
      "sho": 163,
      "koko": 164,
      "shii": 165,
      "sha": 166,
      "dake": 167,
      "ore": 168,
      "omo": 169,
      "kore": 170,
      "ze": 171,
      "cha": 172,
      "an": 173,
      "un": 174,
      "nara": 175,
      "ite": 176,
      "deki": 177,
      "nin": 178,
      "hana": 179,
      "yaku": 180,
      "iu": 181,
      "yoku": 182,
      "kaku": 183,
      "hon": 184,
      "sama": 185,
      "ari": 186,
      "chou": 187,
      "zen": 188,
      "shika": 189,
      "mon": 190,
      "omae": 191,
      "kita": 192,
      "bun": 193,
      "rete": 194,
      "reba": 195,
      "gen": 196,
      "shima": 197,
      "ryou": 198,
      "boku": 199,
      "naku": 200,
      "gai": 201,
      "kei": 202,
      "naru": 203,
      "gu": 204,
      "itte": 205,
      "he": 206,
      "ichi": 207,
      "reta": 208,
      "dan": 209,
      "reru": 210,
      "ata": 211,
      "yu": 212,
      "datta": 213,
      "kimi": 214,
      "shu": 215,
      "ana": 216,
      "nakatta": 217,
      "dakara": 218,
      "anata": 219,
      "ete": 220,
      "made": 221,
      "naka": 222,
      "toki": 223,
      "oira": 224,
      "koro": 225,
      "kon": 226,
      "kari": 227,
      "itsu": 228,
      "ano": 229,
      "darou": 230,
      "jin": 231,
      "tari": 232,
      "....": 233,
      "eru": 234,
      "itta": 235,
      "kare": 236,
      "masu": 237,
      "tame": 238,
      "kedo": 239,
      "pp": 240,
      "in": 241,
      "tteru": 242,
      "ten": 243,
      "rai": 244,
      "??": 245,
      ",,": 246,
      "ie": 247,
      "jo": 248,
      "mitai": 249,
      "jitsu": 250,
      "on": 251,
      "mei": 252,
      "masen": 253,
      "za": 254
    },
    "merges": [
      "h i",
      "k a",
      "t a",
      "n a",
      "n o",
      "o u",
      "s hi",
      "t e",
      "w a",
      "s u",
      "t o",
      ". .",
      "n i",
      "k u",
      "d a",
      "k o",
      "r u",
      "m o",
      "g a",
      "m a",
      "r a",
      "k i",
      "r e",
      "d e",
      "w o",
      "t su",
      "s a",
      ".. .",
      "r i",
      "h a",
      "k e",
      "m i",
      "c hi",
      "t te",
      "s o",
      "s e",
      "y o",
      "na i",
      "y ou",
      "y a",
      "t ta",
      "s h",
      "j i",
      "m e",
      "d o",
      "ka ra",
      "shi te",
      "ko to",
      "n e",
      "b a",
      "u u",
      "r o",
      "shi ta",
      "z u",
      "h o",
      "e n",
      "f u",
      "ka n",
      "s ou",
      "na n",
      "ka i",
      "b u",
      "ta i",
      "g o",
      "h ou",
      "sh ou",
      "ta ku",
      "k ou",
      "a ru",
      "j a",
      "a i",
      "so re",
      "d ou",
      "su ru",
      "m u",
      "i ru",
      "b i",
      "o ku",
      "se n",
      "wa taku",
      "shi n",
      "mo no",
      "ta chi",
      "de su",
      "n na",
      "j ou",
      "se i",
      "ko no",
      "i i",
      "wataku shi",
      "sa n",
      "y uu",
      "hi to",
      "t ou",
      "ma e",
      "sa i",
      "t to",
      "i ta",
      "m ou",
      "ka tta",
      "o i",
      "ku re",
      "b e",
      "z o",
      "i ma",
      "g e",
      "ke n",
      "so no",
      "k you",
      "da i",
      "r ou",
      "g i",
      "sh o",
      "ko ko",
      "shi i",
      "s ha",
      "da ke",
      "o re",
      "o mo",
      "ko re",
      "z e",
      "c ha",
      "a n",
      "u n",
      "na ra",
      "i te",
      "de ki",
      "ni n",
      "ha na",
      "ya ku",
      "i u",
      "yo ku",
      "ka ku",
      "ho n",
      "sa ma",
      "a ri",
      "c hou",
      "z en",
      "shi ka",
      "mo n",
      "o mae",
      "ki ta",
      "bu n",
      "re te",
      "re ba",
      "g en",
      "shi ma",
      "r you",
      "b oku",
      "na ku",
      "ga i",
      "ke i",
      "na ru",
      "g u",
      "i tte",
      "h e",
      "i chi",
      "re ta",
      "da n",
      "re ru",
      "a ta",
      "y u",
      "da tta",
      "ki mi",
      "sh u",
      "a na",
      "na katta",
      "da kara",
      "ana ta",
      "e te",
      "ma de",
      "na ka",
      "to ki",
      "oi ra",
      "ko ro",
      "ko n",
      "ka ri",
      "i tsu",
      "a no",
      "da rou",
      "ji n",
      "ta ri",
      ".. ..",
      "e ru",
      "i tta",
      "ka re",
      "ma su",
      "ta me",
      "ke do",
      "p p",
      "i n",
      "tte ru",
      "te n",
      "ra i",
      "? ?",
      ", ,",
      "i e",
      "j o",
      "mi tai",
      "ji tsu",
      "o n",
      "me i",
      "ma sen",
      "z a"
    ]
  }
}