{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[STOP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SPACE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[STOP]": 0,
      "[UNK]": 1,
      "[SPACE]": 2,
      "!": 3,
      "\"": 4,
      "'": 5,
      "(": 6,
      ")": 7,
      ",": 8,
      "-": 9,
      ".": 10,
      "/": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      ":": 22,
      ";": 23,
      "?": 24,
      "a": 25,
      "b": 26,
      "c": 27,
      "d": 28,
      "e": 29,
      "f": 30,
      "g": 31,
      "h": 32,
      "i": 33,
      "j": 34,
      "k": 35,
      "l": 36,
      "m": 37,
      "n": 38,
      "o": 39,
      "p": 40,
      "q": 41,
      "r": 42,
      "s": 43,
      "t": 44,
      "u": 45,
      "v": 46,
      "w": 47,
      "x": 48,
      "y": 49,
      "z": 50,
      "~": 51,
      "’": 52,
      "“": 53,
      "”": 54,
      "！": 55,
      "？": 56,
      "th": 57,
      "in": 58,
      "ou": 59,
      "re": 60,
      "the": 61,
      "an": 62,
      "..": 63,
      "on": 64,
      "at": 65,
      "er": 66,
      "to": 67,
      "you": 68,
      "ing": 69,
      "is": 70,
      "me": 71,
      "it": 72,
      "st": 73,
      "ll": 74,
      "or": 75,
      "en": 76,
      "...": 77,
      "le": 78,
      "he": 79,
      "se": 80,
      "ar": 81,
      "ve": 82,
      "of": 83,
      "be": 84,
      "as": 85,
      "no": 86,
      "and": 87,
      "we": 88,
      "al": 89,
      "ha": 90,
      "that": 91,
      "so": 92,
      "ed": 93,
      "wh": 94,
      "es": 95,
      "ay": 96,
      "gh": 97,
      "all": 98,
      "for": 99,
      "li": 100,
      "ac": 101,
      "ld": 102,
      "ti": 103,
      "ke": 104,
      "ro": 105,
      "ly": 106,
      "ad": 107,
      "wi": 108,
      "ver": 109,
      "id": 110,
      "ch": 111,
      "ri": 112,
      "bu": 113,
      "go": 114,
      "ght": 115,
      "co": 116,
      "this": 117,
      "do": 118,
      "are": 119,
      "ce": 120,
      "su": 121,
      "ge": 122,
      "lo": 123,
      "out": 124,
      "ould": 125,
      "one": 126,
      "ne": 127,
      "ab": 128,
      "my": 129,
      "now": 130,
      "ust": 131,
      "im": 132,
      "ion": 133,
      "but": 134,
      "ho": 135,
      "have": 136,
      "thing": 137,
      "with": 138,
      "un": 139,
      "pe": 140,
      "if": 141,
      "ta": 142,
      "some": 143,
      "mo": 144,
      "what": 145,
      "fe": 146,
      "tr": 147,
      "de": 148,
      "ir": 149,
      "here": 150,
      "your": 151,
      "can": 152,
      "was": 153,
      "te": 154,
      "ter": 155,
      "ma": 156,
      "ok": 157,
      "any": 158,
      "just": 159,
      "us": 160,
      "not": 161,
      "ther": 162,
      "ally": 163,
      "like": 164,
      "wor": 165,
      "sh": 166,
      "way": 167,
      "ent": 168,
      "there": 169,
      "ple": 170,
      "ind": 171,
      "po": 172,
      "per": 173,
      "time": 174,
      "ic": 175,
      "see": 176,
      "our": 177,
      "am": 178,
      "con": 179,
      "ur": 180,
      "up": 181,
      "ex": 182,
      "oun": 183,
      "pa": 184,
      "ever": 185,
      "they": 186,
      "ca": 187,
      "ant": 188,
      "get": 189,
      "don": 190,
      "about": 191,
      "right": 192,
      "know": 193,
      "od": 194,
      "rom": 195,
      "ation": 196,
      "ven": 197,
      "pl": 198,
      "how": 199,
      "let": 200,
      "com": 201,
      "ill": 202,
      "ard": 203,
      "qu": 204,
      "from": 205,
      "her": 206,
      "would": 207,
      "she": 208,
      "gu": 209,
      "end": 210,
      "sa": 211,
      "ink": 212,
      "nt": 213,
      "ss": 214,
      "oh": 215,
      "ag": 216,
      "fo": 217,
      "ong": 218,
      "will": 219,
      "ound": 220,
      "pp": 221,
      "ct": 222,
      "who": 223,
      "did": 224,
      "ate": 225,
      "well": 226,
      "come": 227,
      "ight": 228,
      "ry": 229,
      "look": 230,
      "uh": 231,
      "use": 232,
      "ack": 233,
      "pro": 234,
      "pre": 235,
      "every": 236,
      "them": 237,
      "think": 238,
      "ah": 239,
      "ye": 240,
      "ine": 241,
      "art": 242,
      "ess": 243,
      "imon": 244,
      "af": 245,
      "paimon": 246,
      "ul": 247,
      "ain": 248,
      "more": 249,
      "bo": 250,
      "il": 251,
      "ough": 252,
      "than": 253,
      "der": 254
    },
    "merges": [
      "t h",
      "i n",
      "o u",
      "r e",
      "th e",
      "a n",
      ". .",
      "o n",
      "a t",
      "e r",
      "t o",
      "y ou",
      "in g",
      "i s",
      "m e",
      "i t",
      "s t",
      "l l",
      "o r",
      "e n",
      ".. .",
      "l e",
      "h e",
      "s e",
      "a r",
      "v e",
      "o f",
      "b e",
      "a s",
      "n o",
      "an d",
      "w e",
      "a l",
      "h a",
      "th at",
      "s o",
      "e d",
      "w h",
      "e s",
      "a y",
      "g h",
      "a ll",
      "f or",
      "l i",
      "a c",
      "l d",
      "t i",
      "k e",
      "r o",
      "l y",
      "a d",
      "w i",
      "v er",
      "i d",
      "c h",
      "r i",
      "b u",
      "g o",
      "gh t",
      "c o",
      "th is",
      "d o",
      "a re",
      "c e",
      "s u",
      "g e",
      "l o",
      "ou t",
      "ou ld",
      "on e",
      "n e",
      "a b",
      "m y",
      "no w",
      "u st",
      "i m",
      "i on",
      "bu t",
      "h o",
      "ha ve",
      "th ing",
      "wi th",
      "u n",
      "p e",
      "i f",
      "t a",
      "so me",
      "m o",
      "wh at",
      "f e",
      "t r",
      "d e",
      "i r",
      "he re",
      "you r",
      "c an",
      "w as",
      "t e",
      "t er",
      "m a",
      "o k",
      "an y",
      "j ust",
      "u s",
      "no t",
      "the r",
      "all y",
      "li ke",
      "w or",
      "s h",
      "w ay",
      "en t",
      "the re",
      "p le",
      "in d",
      "p o",
      "p er",
      "ti me",
      "i c",
      "se e",
      "ou r",
      "a m",
      "c on",
      "u r",
      "u p",
      "e x",
      "ou n",
      "p a",
      "e ver",
      "the y",
      "c a",
      "an t",
      "ge t",
      "d on",
      "ab out",
      "ri ght",
      "k now",
      "o d",
      "ro m",
      "at ion",
      "v en",
      "p l",
      "ho w",
      "le t",
      "co m",
      "i ll",
      "ar d",
      "q u",
      "f rom",
      "h er",
      "w ould",
      "s he",
      "g u",
      "en d",
      "s a",
      "in k",
      "n t",
      "s s",
      "o h",
      "a g",
      "f o",
      "on g",
      "wi ll",
      "oun d",
      "p p",
      "c t",
      "wh o",
      "d id",
      "at e",
      "we ll",
      "co me",
      "i ght",
      "r y",
      "lo ok",
      "u h",
      "u se",
      "ac k",
      "p ro",
      "p re",
      "ever y",
      "the m",
      "th ink",
      "a h",
      "y e",
      "in e",
      "ar t",
      "es s",
      "im on",
      "a f",
      "pa imon",
      "u l",
      "a in",
      "mo re",
      "b o",
      "i l",
      "ou gh",
      "th an",
      "d er"
    ]
  }
}