{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[STOP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SPACE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[STOP]": 0,
      "[UNK]": 1,
      "[SPACE]": 2,
      "!": 3,
      "\"": 4,
      "'": 5,
      "(": 6,
      ")": 7,
      ",": 8,
      "-": 9,
      ".": 10,
      "/": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      ":": 22,
      "?": 23,
      "a": 24,
      "b": 25,
      "c": 26,
      "d": 27,
      "e": 28,
      "g": 29,
      "h": 30,
      "i": 31,
      "j": 32,
      "k": 33,
      "l": 34,
      "m": 35,
      "n": 36,
      "o": 37,
      "p": 38,
      "q": 39,
      "r": 40,
      "s": 41,
      "t": 42,
      "u": 43,
      "v": 44,
      "w": 45,
      "y": 46,
      "z": 47,
      "~": 48,
      "…": 49,
      "《": 50,
      "》": 51,
      "「": 52,
      "」": 53,
      "！": 54,
      "，": 55,
      "？": 56,
      "eo": 57,
      "eu": 58,
      "an": 59,
      "ae": 60,
      "eon": 61,
      "eul": 62,
      "eun": 63,
      "ss": 64,
      "al": 65,
      "ji": 66,
      "ga": 67,
      "il": 68,
      "yeo": 69,
      "ch": 70,
      "do": 71,
      "in": 72,
      "go": 73,
      "yeon": 74,
      "ang": 75,
      "un": 76,
      "yo": 77,
      "geo": 78,
      "hae": 79,
      "ha": 80,
      "ge": 81,
      "ul": 82,
      "han": 83,
      "da": 84,
      "ng": 85,
      "seo": 86,
      "ya": 87,
      "kk": 88,
      "ui": 89,
      "iss": 90,
      "si": 91,
      "eum": 92,
      "am": 93,
      "on": 94,
      "wa": 95,
      "jeon": 96,
      "man": 97,
      "gi": 98,
      "neun": 99,
      "ol": 100,
      "ja": 101,
      "jo": 102,
      "deul": 103,
      "eob": 104,
      "geul": 105,
      "tt": 106,
      "ma": 107,
      "eol": 108,
      "eom": 109,
      "yeong": 110,
      "su": 111,
      "im": 112,
      "geu": 113,
      "mal": 114,
      "na": 115,
      "anh": 116,
      "de": 117,
      "dae": 118,
      "kka": 119,
      "jeong": 120,
      "bo": 121,
      "hal": 122,
      "mo": 123,
      "sa": 124,
      "sin": 125,
      "jeo": 126,
      "geon": 127,
      "dan": 128,
      "nae": 129,
      "eobs": 130,
      "sal": 131,
      "sae": 132,
      "je": 133,
      "eoh": 134,
      "myeon": 135,
      "seon": 136,
      "gess": 137,
      "ye": 138,
      "wo": 139,
      "ne": 140,
      "wi": 141,
      "sang": 142,
      "so": 143,
      "wae": 144,
      "ung": 145,
      "ju": 146,
      "haess": 147,
      "eoss": 148,
      "doe": 149,
      "geos": 150,
      "eung": 151,
      "lo": 152,
      "saeng": 153,
      "bu": 154,
      "haji": 155,
      "gat": 156,
      "geol": 157,
      "yeoss": 158,
      "yeol": 159,
      "jang": 160,
      "salam": 161,
      "gun": 162,
      "ni": 163,
      "seu": 164,
      "deun": 165,
      "ba": 166,
      "yeog": 167,
      "mul": 168,
      "li": 169,
      "eseo": 170,
      "jig": 171,
      "sil": 172,
      "gu": 173,
      "nan": 174,
      "haneun": 175,
      "joh": 176,
      "pp": 177,
      "oe": 178,
      "gag": 179,
      "yu": 180,
      "eulo": 181,
      "ttae": 182,
      "dal": 183,
      "jeog": 184,
      "gan": 185,
      "bun": 186,
      "mu": 187,
      "bal": 188,
      "jal": 189,
      "jin": 190,
      "te": 191,
      "se": 192,
      "wan": 193,
      "ass": 194,
      "leul": 195,
      "bni": 196,
      "cha": 197,
      "ineun": 198,
      "issneun": 199,
      "eohge": 200,
      "haeng": 201,
      "eog": 202,
      "won": 203,
      "mun": 204,
      "bi": 205,
      "bwa": 206,
      "gwa": 207,
      "geun": 208,
      "hi": 209,
      "bnida": 210,
      "mi": 211,
      "uli": 212,
      "ani": 213,
      "deu": 214,
      "ago": 215,
      "yang": 216,
      "gil": 217,
      "dago": 218,
      "mol": 219,
      "nim": 220,
      "bon": 221,
      "jae": 222,
      "hago": 223,
      "jul": 224,
      "dwae": 225,
      "sim": 226,
      "ag": 227,
      "myeong": 228,
      "deo": 229,
      "seong": 230,
      "janh": 231,
      "saenggag": 232,
      "wang": 233,
      "um": 234,
      "geulae": 235,
      "og": 236,
      "nal": 237,
      "chi": 238,
      "jyo": 239,
      "jung": 240,
      "geuleom": 241,
      "naega": 242,
      "dang": 243,
      "bang": 244,
      "deon": 245,
      "aeg": 246,
      "cheon": 247,
      "igo": 248,
      "sig": 249,
      "aneun": 250,
      "jeongmal": 251,
      "jiman": 252,
      "beon": 253,
      "geum": 254
    },
    "merges": [
      "e o",
      "e u",
      "a n",
      "a e",
      "eo n",
      "eu l",
      "eu n",
      "s s",
      "a l",
      "j i",
      "g a",
      "i l",
      "y eo",
      "c h",
      "d o",
      "i n",
      "g o",
      "y eon",
      "an g",
      "u n",
      "y o",
      "g eo",
      "h ae",
      "h a",
      "g e",
      "u l",
      "h an",
      "d a",
      "n g",
      "s eo",
      "y a",
      "k k",
      "u i",
      "i ss",
      "s i",
      "eu m",
      "a m",
      "o n",
      "w a",
      "j eon",
      "m an",
      "g i",
      "n eun",
      "o l",
      "j a",
      "j o",
      "d eul",
      "eo b",
      "g eul",
      "t t",
      "m a",
      "eo l",
      "eo m",
      "yeon g",
      "s u",
      "i m",
      "g eu",
      "m al",
      "n a",
      "an h",
      "d e",
      "d ae",
      "kk a",
      "jeon g",
      "b o",
      "h al",
      "m o",
      "s a",
      "s in",
      "j eo",
      "g eon",
      "d an",
      "n ae",
      "eob s",
      "s al",
      "s ae",
      "j e",
      "eo h",
      "m yeon",
      "s eon",
      "ge ss",
      "y e",
      "w o",
      "n e",
      "w i",
      "s ang",
      "s o",
      "w ae",
      "un g",
      "j u",
      "hae ss",
      "eo ss",
      "do e",
      "geo s",
      "eun g",
      "l o",
      "sae ng",
      "b u",
      "ha ji",
      "ga t",
      "geo l",
      "yeo ss",
      "yeo l",
      "j ang",
      "sal am",
      "g un",
      "n i",
      "s eu",
      "d eun",
      "b a",
      "yeo g",
      "m ul",
      "l i",
      "e seo",
      "ji g",
      "s il",
      "g u",
      "n an",
      "han eun",
      "jo h",
      "p p",
      "o e",
      "ga g",
      "y u",
      "eul o",
      "tt ae",
      "d al",
      "jeo g",
      "g an",
      "b un",
      "m u",
      "b al",
      "j al",
      "ji n",
      "t e",
      "s e",
      "w an",
      "a ss",
      "l eul",
      "b ni",
      "ch a",
      "in eun",
      "iss neun",
      "eoh ge",
      "hae ng",
      "eo g",
      "w on",
      "m un",
      "b i",
      "b wa",
      "g wa",
      "g eun",
      "h i",
      "bni da",
      "m i",
      "ul i",
      "an i",
      "d eu",
      "a go",
      "y ang",
      "g il",
      "da go",
      "m ol",
      "n im",
      "b on",
      "j ae",
      "ha go",
      "j ul",
      "d wae",
      "si m",
      "a g",
      "m yeong",
      "d eo",
      "seon g",
      "j anh",
      "saeng gag",
      "w ang",
      "u m",
      "geul ae",
      "o g",
      "n al",
      "ch i",
      "j yo",
      "j ung",
      "geul eom",
      "nae ga",
      "d ang",
      "b ang",
      "d eon",
      "ae g",
      "ch eon",
      "i go",
      "si g",
      "an eun",
      "jeong mal",
      "ji man",
      "b eon",
      "g eum"
    ]
  }
}