{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[STOP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SPACE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[STOP]": 0,
      "[UNK]": 1,
      "[SPACE]": 2,
      "!": 3,
      ")": 4,
      ",": 5,
      "-": 6,
      ".": 7,
      "/": 8,
      "0": 9,
      "1": 10,
      "2": 11,
      "3": 12,
      "4": 13,
      "5": 14,
      "6": 15,
      "7": 16,
      "8": 17,
      "9": 18,
      "?": 19,
      "a": 20,
      "b": 21,
      "c": 22,
      "d": 23,
      "e": 24,
      "f": 25,
      "g": 26,
      "h": 27,
      "i": 28,
      "j": 29,
      "k": 30,
      "l": 31,
      "m": 32,
      "n": 33,
      "o": 34,
      "p": 35,
      "q": 36,
      "r": 37,
      "s": 38,
      "t": 39,
      "u": 40,
      "v": 41,
      "w": 42,
      "x": 43,
      "y": 44,
      "z": 45,
      "~": 46,
      "‘": 47,
      "…": 48,
      "、": 49,
      "。": 50,
      "《": 51,
      "》": 52,
      "「": 53,
      "」": 54,
      "！": 55,
      "（": 56,
      "）": 57,
      "，": 58,
      "：": 59,
      "；": 60,
      "？": 61,
      "an": 62,
      "i4": 63,
      "sh": 64,
      "ng": 65,
      "e5": 66,
      "zh": 67,
      "ao": 68,
      "u4": 69,
      "i2": 70,
      "en": 71,
      "i3": 72,
      "ang": 73,
      "xi": 74,
      "ji": 75,
      "de5": 76,
      "i1": 77,
      "e4": 78,
      "o3": 79,
      "an4": 80,
      "shi4": 81,
      "hu": 82,
      "wo3": 83,
      "ao4": 84,
      "u3": 85,
      "ng2": 86,
      "ng1": 87,
      "uo": 88,
      "a4": 89,
      "ai4": 90,
      "ao3": 91,
      "a1": 92,
      "an2": 93,
      "ai2": 94,
      "u2": 95,
      "ang4": 96,
      "e3": 97,
      "le5": 98,
      "ng4": 99,
      "yo": 100,
      "an1": 101,
      "e2": 102,
      "a5": 103,
      "en2": 104,
      "bu4": 105,
      "zhe4": 106,
      "ni3": 107,
      "u1": 108,
      "an3": 109,
      "you3": 110,
      "qi": 111,
      "ch": 112,
      "men": 113,
      "men5": 114,
      "uo4": 115,
      "ei4": 116,
      "uo1": 117,
      "zai4": 118,
      "ang1": 119,
      "ang3": 120,
      "eng2": 121,
      "dao4": 122,
      "lai2": 123,
      "jiu4": 124,
      "ng3": 125,
      "yi1": 126,
      "li": 127,
      "ren2": 128,
      "me5": 129,
      "ei2": 130,
      "n1": 131,
      "ta1": 132,
      "en3": 133,
      "hao3": 134,
      "gu": 135,
      "na4": 136,
      "shi2": 137,
      "ui4": 138,
      "ong1": 139,
      "ye3": 140,
      "en1": 141,
      "hui4": 142,
      "e1": 143,
      "yao4": 144,
      "ai1": 145,
      "eng1": 146,
      "a3": 147,
      "ou4": 148,
      "di": 149,
      "yi4": 150,
      "yu": 151,
      "shuo1": 152,
      "zhi1": 153,
      "shen2": 154,
      "ti": 155,
      "ge4": 156,
      "wei4": 157,
      "li3": 158,
      "ba5": 159,
      "chu": 160,
      "bi": 161,
      "n2": 162,
      "ang2": 163,
      "do": 164,
      "mi": 165,
      "mei2": 166,
      "hai2": 167,
      "n4": 168,
      "yi3": 169,
      "yi": 170,
      "ke3": 171,
      "neng2": 172,
      "xiang3": 173,
      "ao1": 174,
      "ma5": 175,
      "su": 176,
      "guo4": 177,
      "qu4": 178,
      "en4": 179,
      "kan4": 180,
      "bu2": 181,
      "eng4": 182,
      "da4": 183,
      "ou3": 184,
      "dou1": 185,
      "dui4": 186,
      "he2": 187,
      "ong2": 188,
      "zuo4": 189,
      "xia4": 190,
      "xin1": 191,
      "hen3": 192,
      "ue2": 193,
      "jian4": 194,
      "shang4": 195,
      "hou4": 196,
      "yang4": 197,
      "zho": 198,
      "er": 199,
      "o2": 200,
      "ji4": 201,
      "li4": 202,
      "yi2": 203,
      "ran2": 204,
      "duo1": 205,
      "ei3": 206,
      "chu1": 207,
      "jia1": 208,
      "zhi3": 209,
      "di4": 210,
      "xi1": 211,
      "a2": 212,
      "qu": 213,
      "zhen1": 214,
      "xiang4": 215,
      "de2": 216,
      "sheng1": 217,
      "bei4": 218,
      "hua4": 219,
      "ei1": 220,
      "xian4": 221,
      "n3": 222,
      "xie1": 223,
      "jue2": 224,
      "dan4": 225,
      "ming2": 226,
      "jing1": 227,
      "qi3": 228,
      "xiao3": 229,
      "ai3": 230,
      "qian2": 231,
      "cheng2": 232,
      "xing2": 233,
      "zhu": 234,
      "ru2": 235,
      "qi2": 236,
      "zi4": 237,
      "ao2": 238,
      "xian1": 239,
      "ni": 240,
      "tian1": 241,
      "dian3": 242,
      "ku": 243,
      "ne5": 244,
      "jie3": 245,
      "pi": 246,
      "i5": 247,
      "zi5": 248,
      "zhi4": 249,
      "wu2": 250,
      "o4": 251,
      "suo3": 252,
      "jin4": 253,
      "zui4": 254
    },
    "merges": [
      "a n",
      "i 4",
      "s h",
      "n g",
      "e 5",
      "z h",
      "a o",
      "u 4",
      "i 2",
      "e n",
      "i 3",
      "an g",
      "x i",
      "j i",
      "d e5",
      "i 1",
      "e 4",
      "o 3",
      "an 4",
      "sh i4",
      "h u",
      "w o3",
      "ao 4",
      "u 3",
      "ng 2",
      "ng 1",
      "u o",
      "a 4",
      "a i4",
      "ao 3",
      "a 1",
      "an 2",
      "a i2",
      "u 2",
      "ang 4",
      "e 3",
      "l e5",
      "ng 4",
      "y o",
      "an 1",
      "e 2",
      "a 5",
      "en 2",
      "b u4",
      "zh e4",
      "n i3",
      "u 1",
      "an 3",
      "yo u3",
      "q i",
      "c h",
      "m en",
      "men 5",
      "uo 4",
      "e i4",
      "uo 1",
      "z ai4",
      "ang 1",
      "ang 3",
      "e ng2",
      "d ao4",
      "l ai2",
      "ji u4",
      "ng 3",
      "y i1",
      "l i",
      "r en2",
      "m e5",
      "e i2",
      "n 1",
      "t a1",
      "en 3",
      "h ao3",
      "g u",
      "n a4",
      "sh i2",
      "u i4",
      "o ng1",
      "y e3",
      "en 1",
      "hu i4",
      "e 1",
      "y ao4",
      "a i1",
      "e ng1",
      "a 3",
      "o u4",
      "d i",
      "y i4",
      "y u",
      "sh uo1",
      "zh i1",
      "sh en2",
      "t i",
      "g e4",
      "w ei4",
      "l i3",
      "b a5",
      "c hu",
      "b i",
      "n 2",
      "ang 2",
      "d o",
      "m i",
      "m ei2",
      "h ai2",
      "n 4",
      "y i3",
      "y i",
      "k e3",
      "n eng2",
      "xi ang3",
      "ao 1",
      "m a5",
      "s u",
      "g uo4",
      "q u4",
      "en 4",
      "k an4",
      "b u2",
      "e ng4",
      "d a4",
      "o u3",
      "do u1",
      "d ui4",
      "h e2",
      "o ng2",
      "z uo4",
      "xi a4",
      "xi n1",
      "h en3",
      "u e2",
      "ji an4",
      "sh ang4",
      "h ou4",
      "y ang4",
      "zh o",
      "e r",
      "o 2",
      "j i4",
      "l i4",
      "y i2",
      "r an2",
      "d uo1",
      "e i3",
      "chu 1",
      "ji a1",
      "zh i3",
      "d i4",
      "xi 1",
      "a 2",
      "q u",
      "zh en1",
      "xi ang4",
      "d e2",
      "sh eng1",
      "b ei4",
      "hu a4",
      "e i1",
      "xi an4",
      "n 3",
      "xi e1",
      "j ue2",
      "d an4",
      "mi ng2",
      "ji ng1",
      "q i3",
      "xi ao3",
      "a i3",
      "qi an2",
      "ch eng2",
      "xi ng2",
      "zh u",
      "r u2",
      "q i2",
      "z i4",
      "ao 2",
      "xi an1",
      "n i",
      "ti an1",
      "di an3",
      "k u",
      "n e5",
      "ji e3",
      "p i",
      "i 5",
      "z i5",
      "zh i4",
      "w u2",
      "o 4",
      "su o3",
      "ji n4",
      "z ui4"
    ]
  }
}